required_courses = {
    "MYY101": ("Agglika gia thn Episthmh twn Ypologistwn I", 2),
    "MYY102": ("Apeirostikos Logismos I", 5.5),
    "MYY103": ("Genikh Fysikh", 5.5),
    "MYY104": ("Grammikh Algebra", 5.5),
    "MYY105": ("Eisagwgh ston Programmatismo", 6),
    "MYY106": ("Eisagwgh stous H/Y kai thn Plhroforikh", 5.5),
    "MYY201": ("Agglika gia thn Episthmh twn Ypologistwn II", 3.5),
    "MYY202": ("Apeirostikos Logismos II", 6.5),
    "MYY203": ("Vasikes Arxes Kyklwmatwn", 6.5),
    "MYY204": ("Diakrita Mathimatika I", 6.5),
    "MYY205": ("Texnikes Antikeimenostrafous Programmatismou", 7),
    "MYY301": ("Anaptyksh Logismikou", 6),
    "MYY302": ("Diakrita Mathimatika II", 6),
    "MYY303": ("Domes Dedomenwn", 6),
    "MYY304": ("Pithanotites kai Statistikh", 6),
    "MYY305": ("Pshfiakh Sxediash I", 6),
    "MYY401": ("Arxes Glwsswn Programmatismou", 6),
    "MYY403": ("Eisagwgh sthn Arithmitikh Analysh", 6),
    "MYY404": ("Hlektronikh", 6),
    "MYY405": ("Sxediash kai Analysh Algorithmwn", 6),
    "MYY406": ("Pshfiakh Sxediash II", 6),
    "MYY501": ("Thewria Ypologismou", 6),
    "MYY502": ("Programmatismos Systhmatwn", 6),
    "MYY503": ("Shmata kai Systhmata", 6),
    "MYY504": ("Ypologistika Mathimatika", 6),
    "MYY505": ("Arxitektonikh Ypologistwn", 6),
    "MYY601": ("Leitourgika Systhmata", 7),
    "MYY602": ("Texnhth Nohmosynh", 6.5),
    "MYY603": ("Thlepoikinwniaka Systhmata", 6.5),
    "MYY701": ("Vaseis Dedomenwn", 6.5),
    "MYY702": ("Grafika Systhmata kai Systhmata Allhlepirdashs", 6.5),
    "MYY703": ("Diktya Ypologistwn I", 7),
    "MYY801": ("Diktya Ypologistwn II", 6.5),
    "MYY802": ("Metafrastes", 6.5),
    "MYY803": ("Texnologia Logismikou", 7),
    "MYY901": ("Mikroepeksergastes", 5),
    "MYY1000": ("Ptyxiakh Ergasia", 15)
}

non_required_courses = {
    
    "ΜΥΕ001": ("Αλληλεπίδραση Ανθρώπου Υπολογιστή", 5),
    "ΜΥΕ002": ("Μηχανική Μάθηση", 5),
    "ΜΥΕ003": ("Ανάκτηση Πληροφορίας", 5),
    "ΜΥΕ004": ("Ανάπτυξη Λογισμικού ΙΙ", 5),
    "ΜΥΕ005": ("Αρχιτεκτονική Υπολογιστών ΙΙ", 5),
    "ΜΥΕ006": ("Ασύρματα Δίκτυα", 5),
    "ΜΥΕ007": ("Ασφάλεια Υπολογιστικών και Επικοινωνιακών Συστημάτων", 5),
    "ΜΥΕ008": ("Βελτιστοποίηση", 5),
    "ΜΥΕ009": ("Γραμμικός Προγραμματισμός και Συνδυαστική Βελτιστοποίηση", 5),
    "ΜΥΕ010": ("Δοκιμή και Αξιοπιστία Ηλεκτρονικών Συστημάτων", 5),
    "ΜΥΕ011": ("Εξελικτικός Υπολογισμός", 5),
    "ΜΥΕ012": ("Εξόρυξη Δεδομένων", 5),
    "ΜΥΕ013": ("Εφαρμοσμένη Στατιστική", 5),
    "ΜΥΕ014": ("Θεωρία Γραφημάτων", 5),
    "ΜΥΕ015": ("Θεωρία Πληροφορίας και Κωδίκων", 5),
    "ΜΥΕ016": ("Ιατρική Πληροφορική", 5),
    "ΜΥΕ017": ("Κατανεμημένα Συστήματα", 5),
    "ΜΥΕ018": ("Κυκλώματα VLSI", 5),
    "ΜΥΕ019": ("Λειτουργικά Συστήματα II", 5),
    "ΜΥΕ020": ("Μεταφραστές ΙΙ", 5),
    "ΜΥΕ022": ("Μοντέλα Υπολογισμού και Τυπικές Γλώσσες", 5),
    "ΜΥΕ023": ("Παράλληλα Συστήματα και Προγραμματισμός", 5),
    "ΜΥΕ024": ("Παράλληλοι Aλγόριθμοι", 5),
    "ΜΥΕ025": ("Πολυμέσα", 5),
    "ΜΥΕ026": ("Προγραμματισμός Δικτύων", 5),
    "ΜΥΕ027": ("Προγραμματισμός σε FORTRAN", 5),
    "ΜΥΕ028": ("Προηγμένη Σχεδίαση Αλγορίθμων και Δομών Δεδομένων", 5),
    "ΜΥΕ029": ("Προσομοίωση και Μοντελοποίηση Υπολογιστικών Συστημάτων", 5),
    "ΜΥΕ030": ("Προχωρημένα Θέματα Τεχνολογίας και Εφαρμογών Βάσεων Δεδομένων", 5),
    "ΜΥΕ031": ("Ρομποτική", 5),
    "ΜΥΕ032": ("Συστήματα Αυτομάτου Ελέγχου", 5),
    "ΜΥΕ033": ("Τεχνολογία Λογισμικού ΙΙ", 5),
    "ΜΥΕ034": ("Υπολογιστική Γεωμετρία", 5),
    "ΜΥΕ035": ("Υπολογιστική Νοημοσύνη", 5),
    "ΜΥΕ036": ("Υπολογιστική Πολυπλοκότητα", 5),
    "ΜΥΕ037": ("Ψηφιακή Eπεξεργασία Eικόνας", 5),
    "ΜΥΕ038": ("Ψηφιακή Eπεξεργασία Σήματος", 5),
    "ΜΥΕ040": ("Αριθμητική Γραμμική Άλγεβρα", 5),
    "ΜΥΕ041": ("Διαχείριση Σύνθετων Δεδομένων", 5),
    "ΜΥΕ042": ("Τεχνολογίες Διαδικτύου", 5),
    "ΜΥΕ043": ("Αυτόνομοι Πράκτορες", 5),
    "ΜΥΕ044": ("Επιχειρηματικότητα στην Πληροφορική", 5),
    "ΜΥΕ045": ("Αλγόριθμοι Απόκρυψης Πληροφορίας", 5),
    "ΜΥΕ046": ("Υπολογιστική Όραση", 5),
    "ΜΥΕ047": ("Αλγοριθμικές Τεχνικές για Δεδομένα Ευρείας Κλίμακας", 5),
    "ΜΥΕ048": ("Ασύρματες Ζεύξεις", 5),
    "ΜΥΕ049": ("Συστήματα Κινητών Επικοινωνιών", 5),
    "ΜΥΕ050": ("Διδακτική της Πληροφορικής", 5),
    "ΜΥΕ051": ("Εικονική, Επαυξημένη και Μικτή Πραγματικότητα", 5),
    "ΜΥΕ052": ("Προηγμένες Μέθοδοι 3Δ Γραφικών", 5),
    "ΜΥΕ053": ("Επεξεργασία Φυσικής Γλώσσας", 5),
    "ΜΥΕ054": ("Σχεδίαση Αναλογικών Κυκλωμάτων", 5),
    "ΜΥΕ1001": ("Ειδικά Θέματα Συστημάτων και Δικτύων", 5),
    "ΜΥΕ1002": ("Ειδικά Θέματα Θεωρητικής Πληροφορικής", 5),
    "ΜΥΕ1003": ("Eιδικά Θέματα Eφαρμογών Πληροφορικής", 5),
    "ΜΥΕ1004": ("Eιδικά Θέματα Yπολογιστικών Mαθηματικών", 5),
    "ΜΥΕ1005": ("Eιδικά Θέματα Λογισμικού", 5),
    "ΜΥΕ1006": ("Eιδικά Θέματα Στατιστικής και Eπιχειρησιακής Έρευνας", 5),
    "ΜΥΕ1007": ("Εισαγωγή της Πρακτικής Άσκησης στη Διδακτική", 5),
    "ΜΥΕ1000": ("Πρακτική Άσκηση", 1)
}


total = 0
required_ects = 10

for i in required_courses:
    print(f"Course: {i} {required_courses[i][0]}")
    if (input("passed [Y/N]]?").upper().strip() == "Y"):
        total += required_courses[i][1]
    
        
        
# inp = input("enter non-required course code (only the number) that you have passed - when you have no more courses, input 'e': ")
    
# while (inp!="e"):
    
    
    
if total >= required_ects:
    print("good")
else:
    print(f"not enough ECTS, total ECTS collected: {total}")